GopalSaraf/Practicals/PSDL/include/proc/pic16lf1513.inc
// Register: AADGRD
#define AADGRD AADGRD
AADGRD                                   equ 0718h
// bitfield definitions
AADGRD_GRDPOL_POSN                       equ 0005h
AADGRD_GRDPOL_POSITION                   equ 0005h
AADGRD_GRDPOL_SIZE                       equ 0001h
AADGRD_GRDPOL_LENGTH                     equ 0001h
AADGRD_GRDPOL_MASK                       equ 0020h
AADGRD_GRDAOE_POSN                       equ 0006h
AADGRD_GRDAOE_POSITION                   equ 0006h
AADGRD_GRDAOE_SIZE                       equ 0001h
AADGRD_GRDAOE_LENGTH                     equ 0001h
AADGRD_GRDAOE_MASK                       equ 0040h
AADGRD_GRDBOE_POSN                       equ 0007h
AADGRD_GRDBOE_POSITION                   equ 0007h
AADGRD_GRDBOE_SIZE                       equ 0001h
AADGRD_GRDBOE_LENGTH                     equ 0001h
AADGRD_GRDBOE_MASK                       equ 0080h

// Register: AADCAP
#define AADCAP AADCAP
AADCAP                                   equ 0719h
// bitfield definitions
AADCAP_ADDCAP0_POSN                      equ 0000h
AADCAP_ADDCAP0_POSITION                  equ 0000h
AADCAP_ADDCAP0_SIZE                      equ 0001h
AADCAP_ADDCAP0_LENGTH                    equ 0001h
AADCAP_ADDCAP0_MASK                      equ 0001h
AADCAP_ADDCAP1_POSN                      equ 0001h
AADCAP_ADDCAP1_POSITION                  equ 0001h
AADCAP_ADDCAP1_SIZE                      equ 0001h
AADCAP_ADDCAP1_LENGTH                    equ 0001h
AADCAP_ADDCAP1_MASK                      equ 0002h
AADCAP_ADDCAP2_POSN                      equ 0002h
AADCAP_ADDCAP2_POSITION                  equ 0002h
AADCAP_ADDCAP2_SIZE                      equ 0001h
AADCAP_ADDCAP2_LENGTH                    equ 0001h
AADCAP_ADDCAP2_MASK                      equ 0004h
AADCAP_ADDCAP_POSN                       equ 0000h
AADCAP_ADDCAP_POSITION                   equ 0000h
AADCAP_ADDCAP_SIZE                       equ 0003h
AADCAP_ADDCAP_LENGTH                     equ 0003h
AADCAP_ADDCAP_MASK                       equ 0007h

// Register: AADRES0L
#define AADRES0L AADRES0L
AADRES0L                                 equ 071Ah
// bitfield definitions
AADRES0L_ADRES0L_POSN                    equ 0000h
AADRES0L_ADRES0L_POSITION                equ 0000h
AADRES0L_ADRES0L_SIZE                    equ 0008h
AADRES0L_ADRES0L_LENGTH                  equ 0008h
AADRES0L_ADRES0L_MASK                    equ 00FFh

// Register: AADRES0H
#define AADRES0H AADRES0H
AADRES0H                                 equ 071Bh
// bitfield definitions
AADRES0H_ADRES0H_POSN                    equ 0000h
AADRES0H_ADRES0H_POSITION                equ 0000h
AADRES0H_ADRES0H_SIZE                    equ 0008h
AADRES0H_ADRES0H_LENGTH                  equ 0008h
AADRES0H_ADRES0H_MASK                    equ 00FFh

// Register: AADRES1L
#define AADRES1L AADRES1L
AADRES1L                                 equ 071Ch
// bitfield definitions
AADRES1L_ADRES1L_POSN                    equ 0000h
AADRES1L_ADRES1L_POSITION                equ 0000h
AADRES1L_ADRES1L_SIZE                    equ 0008h
AADRES1L_ADRES1L_LENGTH                  equ 0008h
AADRES1L_ADRES1L_MASK                    equ 00FFh

// Register: AADRES1H
#define AADRES1H AADRES1H
AADRES1H                                 equ 071Dh
// bitfield definitions
AADRES1H_ADRES1H_POSN                    equ 0000h
AADRES1H_ADRES1H_POSITION                equ 0000h
AADRES1H_ADRES1H_SIZE                    equ 0008h
AADRES1H_ADRES1H_LENGTH                  equ 0008h
AADRES1H_ADRES1H_MASK                    equ 00FFh

// Register: STATUS_SHAD
#define STATUS_SHAD STATUS_SHAD
STATUS_SHAD                              equ 0FE4h
// bitfield definitions
STATUS_SHAD_C_SHAD_POSN                  equ 0000h
STATUS_SHAD_C_SHAD_POSITION              equ 0000h
STATUS_SHAD_C_SHAD_SIZE                  equ 0001h
STATUS_SHAD_C_SHAD_LENGTH                equ 0001h
STATUS_SHAD_C_SHAD_MASK                  equ 0001h
STATUS_SHAD_DC_SHAD_POSN                 equ 0001h
STATUS_SHAD_DC_SHAD_POSITION             equ 0001h
STATUS_SHAD_DC_SHAD_SIZE                 equ 0001h
STATUS_SHAD_DC_SHAD_LENGTH               equ 0001h
STATUS_SHAD_DC_SHAD_MASK                 equ 0002h
STATUS_SHAD_Z_SHAD_POSN                  equ 0002h
STATUS_SHAD_Z_SHAD_POSITION              equ 0002h
STATUS_SHAD_Z_SHAD_SIZE                  equ 0001h
STATUS_SHAD_Z_SHAD_LENGTH                equ 0001h
STATUS_SHAD_Z_SHAD_MASK                  equ 0004h

// Register: WREG_SHAD
#define WREG_SHAD WREG_SHAD
WREG_SHAD                                equ 0FE5h
// bitfield definitions
WREG_SHAD_WREG_SHAD_POSN                 equ 0000h
WREG_SHAD_WREG_SHAD_POSITION             equ 0000h
WREG_SHAD_WREG_SHAD_SIZE                 equ 0008h
WREG_SHAD_WREG_SHAD_LENGTH               equ 0008h
WREG_SHAD_WREG_SHAD_MASK                 equ 00FFh

// Register: BSR_SHAD
#define BSR_SHAD BSR_SHAD
BSR_SHAD                                 equ 0FE6h
// bitfield definitions
BSR_SHAD_BSR_SHAD_POSN                   equ 0000h
BSR_SHAD_BSR_SHAD_POSITION               equ 0000h
BSR_SHAD_BSR_SHAD_SIZE                   equ 0005h
BSR_SHAD_BSR_SHAD_LENGTH                 equ 0005h
BSR_SHAD_BSR_SHAD_MASK                   equ 001Fh

// Register: PCLATH_SHAD
#define PCLATH_SHAD PCLATH_SHAD
PCLATH_SHAD                              equ 0FE7h
// bitfield definitions
PCLATH_SHAD_PCLATH_SHAD_POSN             equ 0000h
PCLATH_SHAD_PCLATH_SHAD_POSITION         equ 0000h
PCLATH_SHAD_PCLATH_SHAD_SIZE             equ 0007h
PCLATH_SHAD_PCLATH_SHAD_LENGTH           equ 0007h
PCLATH_SHAD_PCLATH_SHAD_MASK             equ 007Fh

// Register: FSR0L_SHAD
#define FSR0L_SHAD FSR0L_SHAD
FSR0L_SHAD                               equ 0FE8h
// bitfield definitions
FSR0L_SHAD_FSR0L_SHAD_POSN               equ 0000h
FSR0L_SHAD_FSR0L_SHAD_POSITION           equ 0000h
FSR0L_SHAD_FSR0L_SHAD_SIZE               equ 0008h
FSR0L_SHAD_FSR0L_SHAD_LENGTH             equ 0008h
FSR0L_SHAD_FSR0L_SHAD_MASK               equ 00FFh

// Register: FSR0H_SHAD
#define FSR0H_SHAD FSR0H_SHAD
FSR0H_SHAD                               equ 0FE9h
// bitfield definitions
FSR0H_SHAD_FSR0H_SHAD_POSN               equ 0000h
FSR0H_SHAD_FSR0H_SHAD_POSITION           equ 0000h
FSR0H_SHAD_FSR0H_SHAD_SIZE               equ 0008h
FSR0H_SHAD_FSR0H_SHAD_LENGTH             equ 0008h
FSR0H_SHAD_FSR0H_SHAD_MASK               equ 00FFh

// Register: FSR1L_SHAD
#define FSR1L_SHAD FSR1L_SHAD
FSR1L_SHAD                               equ 0FEAh
// bitfield definitions
FSR1L_SHAD_FSR1L_SHAD_POSN               equ 0000h
FSR1L_SHAD_FSR1L_SHAD_POSITION           equ 0000h
FSR1L_SHAD_FSR1L_SHAD_SIZE               equ 0008h
FSR1L_SHAD_FSR1L_SHAD_LENGTH             equ 0008h
FSR1L_SHAD_FSR1L_SHAD_MASK               equ 00FFh

// Register: FSR1H_SHAD
#define FSR1H_SHAD FSR1H_SHAD
FSR1H_SHAD                               equ 0FEBh
// bitfield definitions
FSR1H_SHAD_FSR1H_SHAD_POSN               equ 0000h
FSR1H_SHAD_FSR1H_SHAD_POSITION           equ 0000h
FSR1H_SHAD_FSR1H_SHAD_SIZE               equ 0008h
FSR1H_SHAD_FSR1H_SHAD_LENGTH             equ 0008h
FSR1H_SHAD_FSR1H_SHAD_MASK               equ 00FFh

// Register: STKPTR
#define STKPTR STKPTR
STKPTR                                   equ 0FEDh
// bitfield definitions
STKPTR_STKPTR_POSN                       equ 0000h
STKPTR_STKPTR_POSITION                   equ 0000h
STKPTR_STKPTR_SIZE                       equ 0005h
STKPTR_STKPTR_LENGTH                     equ 0005h
STKPTR_STKPTR_MASK                       equ 001Fh

